src/config/Documents/ПолитикаЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПолитикаЦенообразования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПолитикаЦенообразованияКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолныйТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПолитикаЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРезультат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Правила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпускнаяЦена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначенийПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/InformationRegisters/ПолитикаЦенообразованияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПолитикаЦенообразованияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолитикаЦенообразования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПолитикаЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ВидыОперацийПолитикаЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПолитикаЦенообразования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтрольМинимальныхЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическийРасчетЦен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ПолитикаЦенообразования/Ext/ObjectModule.bsl
функция СтрокаВСписок(строка1) Экспорт
	списЗнач = новый СписокЗначений;
	строка0 = строка1;
	Если строка0="" тогда
		возврат списЗнач;
	КонецЕсли;
	Кол = стрЧислоВхождений(строка0, ";") + 1;
	i = Найти(строка0,";"); L = стрДлина(строка0);
	пока i>0 цикл
		списЗнач.Добавить( Лев(строка0, i-1) ); 
		строка0 = прав(строка0, L-i);
		i = Найти(строка0,";"); L = стрДлина(строка0);
	КонецЦикла;	
	списЗнач.Добавить(строка0); // Единственная или последняя

	возврат списЗнач;
	
КонецФункции	


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВидОперации=Перечисления.ВидыОперацийПолитикаЦенообразования.АвтоматическийРасчетЦен Тогда
		Движение = Движения.ПолитикаЦенообразованияКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ПолитикаЦенообразования = Ссылка;
	КонецЕсли;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверка: ТипЦЕн должен быть обязательно указан
	Для каждого Правило ИЗ Правила Цикл
		Если Найти(ВРЕГ(Правило.Правило),"ТИПЦЕН")=0 Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Правило.НомерСтроки) +" не указано условие ТипЦен",Отказ);
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого Параметр ИЗ Параметры Цикл
		Если ЗначениеНеЗаполнено(Параметр.ИмяПараметра)  Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Параметр.НомерСтроки) +" не указано имя параметра",Отказ);
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(Параметр.ЗначениеПараметра)  Тогда
			СообщитьОбОшибке ("В строке №"+ Строка(Параметр.НомерСтроки) +" не указано значение параметра",Отказ);
		КонецЕсли;
	КонецЦикла;	
	
	Если Не Отказ Тогда
		ТекстЗапросаДляВставкиЦена="ВЫБОР ";
		Для сч=0 по Правила.Количество()-1 Цикл
			ТекстЗапросаДляВставкиЦена=ТекстЗапросаДляВставкиЦена+ " КОГДА " + Правила[сч].Правило + " ТОГДА " + Правила[сч].ОтпускнаяЦена;
		КонецЦикла;
		ТекстЗапросаДляВставкиЦена=ТекстЗапросаДляВставкиЦена+" ИНАЧЕ 0 КОНЕЦ МинимальнаяЦена " ;
		
		ТекстЗапросаДляВставкиПриоритет="ВЫБОР ";
		Для сч=0 по Правила.Количество()-1 Цикл
			ТекстЗапросаДляВставкиПриоритет=ТекстЗапросаДляВставкиПриоритет+ " КОГДА " + Правила[сч].Правило + " ТОГДА " + Правила[сч].НомерСтроки;
		КонецЦикла;
		ТекстЗапросаДляВставкиПриоритет=ТекстЗапросаДляВставкиПриоритет+" ИНАЧЕ 1000 КОНЕЦ Приоритет " ;
		
		ПолныйТекстЗапроса = ТекстЗапросаДляВставкиЦена+ ", "+ТекстЗапросаДляВставкиПриоритет;
	КонецЕсли;


	
КонецПроцедуры
